//
//  TermsViewController.swift
//  MyISProject
//
//  Created by Jaruwit Sriburanasorn on 10/27/2560 BE.
//  Copyright © 2560 Kamonpan Ketlue. All rights reserved.
//

import UIKit

class TermsViewController: UIViewController {

    @IBOutlet weak var textView: UITextView!
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        // Do any additional setup after loading the view.
        self.textView.text = "ท่านต้องรับผิดชอบต่อเนื้อหาของผู้ใช้ที่ท่านเป็นผู้จัดทำขึ้น และผลกระทบหรือเกี่ยวข้องจากข้อมูลดังกล่าว (รวมถึงการสูญเสียหรือความเสียหายที่เกิดต่อแอพพลิเคชั่น) ท่านรับรองต่อแอพพลิเคชั่นไอวารันตรีว่า \n1. ท่านเป็นเจ้าของและมีสิทธิทุกประการต่อเนื้อหาของผู้ใช้ หรือมีสิทธิโดยชอบธรรมในการให้เนื้อหาของผู้ใช้ของท่าน \n2. เนื้อหาของผู้ใช้ของท่านไม่ละเมิดทรัพย์สินทางปัญญาของบุคคลที่สาม \n3. เนื้อหาของผู้ใช้ของท่านไม่เป็นอันตราย ไม่ถูกต้อง ลามกอนาจาร ข่มขู่ หมิ่นประมาท หรือผิดกฎหมาย หรือไม่ถูกต้องตามข้อกำหนดกฎหมายที่เกี่ยวข้อง \n4. เนื้อหาของผู้ใช้ต้องไม่มีไวรัส ซอฟแวร์ รหัส วิธีการที่คล้ายกัน หรืออุปกรณ์ที่เป็นอันตราย หรืออาจเป็นอันตราย ทำลาย ปิดการใช้งาน มีผลกระทบในทางไม่ดี จำกัดการทำงาน รวมตลอดถึงเซิฟเวอร์ โหนดเครือข่าย และอุปกรณ์อื่น ๆ ที่คล้ายคลึงกัน \n5. ท่านตกลงยอมชดใช้และไม่เรียกร้องจากแอพพลิเคชั่นไอวารันตรีต่อการสูญเสีย ความเสียหาย ภาระรับผิดหรือค่าใช้จ่าย ๆ ที่แอพพลิเคชั่นไอวารันตรีก่อให้เกิดขึ้น อันเป็นผลจากการละเมิดการรับรองเหล่านี้ \n6. เมื่อท่านอัพโหลด (uploading) ส่ง สร้าง หรือให้ข้อมูล เอกสาร ไฟล์สื่อ หรือเนื้อหาอื่นใดผ่านบริการ (ถือเป็น “เนื้อหาของผู้ใช้”) ท่านอนุญาตให้แอพพลิเคชั่นไอวารันตรีและบุคคลที่เกี่ยวข้องกับการให้บริการสามารถใช้เนื้อหาดังกล่าวได้โดยไม่สามารถเรียกสิทธิคืน ไม่จำกัด ใช้ได้ทั่วโลก ไม่ต้องเสียค่าสิทธิให้ สิทธิที่ไม่ใช่ใช้แต่เพียงผู้เดียว ในการคัดลอก ทำซ้ำ ดัดแปลง แก้ไข ปรับปรุง แจกจ่าย แปล ทำให้เป็นรูปแบบดิจิทัล พิมพ์ เผยแพร่ หรือจัดแสดงแก่สาธารณชนเกี่ยวกับเนื้อหาของผู้ใช้ดังกล่าว (“การให้อนุญาตใช้เนื้อหาของผู้ใช้”) “การให้อนุญาตใช้เนื้อหาของผู้ใช้” จะถูกใช้อย่างจำกัดเพื่อวัตถุประสงค์ในการให้บริการของแอพพลิเคชั่นไอวารันตรีเท่านั้น \n7. ให้บุคคลที่สามซึ่งเป็นผู้ร่วมในการจัดทำบริการของแอพพลิเคชั่น เข้าถึง หรือรับช่วงสิทธิการรับอนุญาตใช้เนื้อหาของผู้ใช้ เพื่อการจัดทำบริการของบริษัทฯ \n8. แอพพลิเคชั่นไม่ได้ถือสิทธิเป็นเจ้าของเนื้อหาของผู้ใช้ที่ท่านเป็นคนจัดทำขึ้น ท่านยังเป็นเจ้าของลิขสิทธิ์ และสิทธิอื่น ๆ ในเนื้อหาของผู้ใช้ดังกล่าวและที่ปรากฎในระบบการให้บริการ \n9. ท่านต้องรับผิดขอบปกป้องและบังคับใช้สิทธิแห่งทรัพย์สินทางปัญญาซึ่งเกิดจากเนื้อหาของผู้ใช้ที่ท่านเป็นผู้จัดทำขึ้นเอง แอพลิเคชั่นไอวารันตรีไม่มีหน้าที่รับผิดชอบในการปกป้องสิทธิแห่งทรัพย์สินทางปัญญาแทนท่าน"
        self.title = "ข้อตกลงและเงื่อนไขการใช้งาน"
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    

    /*
    // MARK: - Navigation

    // In a storyboard-based application, you will often want to do a little preparation before navigation
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        // Get the new view controller using segue.destinationViewController.
        // Pass the selected object to the new view controller.
    }
    */

}
